:PROPERTIES:
:ID:       970c5eed-6ca4-44cd-8bd2-8bed99128d94
:END:
#+title: elisp-3rd-dash-!cons
#+date: [2024-08-03 六]
#+last_modified:  



#+begin_src emacs-lisp 
(setq m-var "var")
(setq m-var-1 "var1")

(!cons m-var m-var-1 )

(message "%s %s" m-var m-var-1)


#+end_src

#+RESULTS:
: var (var . var1)


#+begin_src emacs-lisp :tangle yes

(setq m-var "var")
(setq m-var-1 "var1")

(message "%s" (cons m-var m-var-1))
#+end_src

#+RESULTS:
: (var . var1)

